{
  "PaymentPolicy": {
    "title_page": "Payment Policy",
    "content_1": "Customers pay directly at the store",
    "content_2": "+ Get a free gift",
    "content_3": "+ Check in at the store Customers pay online",
    "content_4": "+ Transfer before receiving goods",
    "content_5": "+ Any free gift Customers who need to complain or return products due to Tonatra's fault can contact Hotline 0292 3831 530 for the earliest support.",
    "content_6": "The consultant will guide the customer through the necessary steps to make the payment."
  },
  "Header": {
    "Navbar": {
      "close": "Close",
      "home": "Home",
      "introduce": "About us",
      "menu": "Menu",
      "bestDish": "Best Dish",
      "deliciousDish": "Delicious Dish",
      "news": "News",
      "contact": "Contact",
      "booking": "Booking",
      "login": "Login",
      "register": "Register",
      "logout": "Logout",
      "favoriteDish": "Favorite",
      "search": "SEARCH YOUR DISH:",
      "inputSearch": "Enter the name of the dish...",
      "resultSearch": "SEARCH RESULT",
      "myAccount": "My Account"
    }
  },
  "Footer": {
    "introduce": "Our restaurant always puts customers first, dedicated to serving, bringing customers the best experiences. Dishes with exclusive recipes will bring new flavors to diners. Tonatra sincerely thanks.",
    "branch": "Branch",
    "address": "Address",
    "phone": "PhoneNumber",
    "email": "Email",
    "title_instruct": "Instructions",
    "instruct_1": "Buying Guide",
    "instruct_2": "Payment Instructions",
    "instruct_3": "Register as a member",
    "instruct_4": "Customer Support",
    "title_policy": "Policy",
    "policy_1": "Membership Policy",
    "policy_2": "Payment Policy",
    "policy_3": "Buying Guide",
    "policy_4": "Information Security",
    "social": "Social network",
    "method_payment": "Payment method",
    "copy_right": "Copyright | © 2024 Tonatra CTU Group 4 CT250"
  },
  "BreadcrumbsAndTitle": {
    "home": "Home",
    "contact": "Contact",
    "news": "News",
    "introduction": "About us",
    "delicious_dishes": "Delicious dishes",
    "best_dishes": "Best dishes",
    "login": "Login",
    "register": "Register",
    "cart": "Cart",
    "booking": "Booking",
    "all_dishes": "All dishes",
    "my_account": "My account",
    "search": "Search",
    "payment_instruction": "Payment instruction",
    "buying_guide": "Buying guide",
    "membership_policy": "Membership policy",
    "payment_policy": "Payment policy",
    "information_security": "Information security",
    "favorite_dishes": "Favorite dishes",
    "not_found": "404 Page not found",
    "payment": "Payment",
    "reset_password": "Reset Password"
  },
  "Auth": {
    "login": "Login",
    "register": "Register",
    "username": "Username",
    "email": "Email",
    "password": "Password",
    "confirm_password": "Confirm password",
    "forgot_password": "Forgot password?",
    "login_with": "Or login with",
    "required_email": "Email is required",
    "invalid_email": "Invalid email",
    "password_min": "Password must be at least 6 characters",
    "password_max": "Password must be at most 25 characters",
    "required_password": "Password is required",
    "required_username": "Username is required",
    "required_confirm_password": "Confirm password is required",
    "confirm_password_not_match": "Confirm password does not match"
  },
  "Contact": {
    "title": "Contact Us",
    "fullName": "Full Name",
    "email": "Email",
    "phoneNumber": "Phone Number",
    "content": "Content",
    "button": "Submit",
    "invalid_fullName": "Please enter your full name",
    "invalid_email": "Invalid email",
    "required_email": "Please enter your email",
    "invalid_phoneNumber": "Invalid phone number!",
    "required_phoneNumber": "Please enter your phone number",
    "required_content": "Please enter the content",
    "introduce": {
      "title": "Tonatra Restaurant",
      "des": "Tonatra Restaurant - where culinary experiences flourish. Our restaurant always puts customers first, dedicated service, and gives customers the best experience. Dishes with exclusive recipes will bring new flavors to diners. Don't miss the opportunity to enjoy delicious food at affordable prices at Tonatra. We are pleased to serve you. Tonatra Restaurant sincerely thanks you.",
      "branch": "Main Branch",
      "address": "Address: ",
      "phoneNumber": "Phone: ",
      "email": "Email: "
    }
  },
  "BuyingGuide": {
    "title": "Buying Guide",
    "content_1": "Step 1: Visit the website and choose the food you want to buy",
    "content_2": "Step 2: Click on the product you want to buy, the screen will display a pop up with the following options. If you want to continue shopping: Click on continue shopping to choose to add products to the cart. If you want to view the cart to update the product: Click on view cart If you want to order and pay for this product, please click: Order and pay",
    "content_3": "Step 3: Select payment account information. If you already have an account, please enter your login name, email, and password in the already have an account section on the system. If you do not have an account and want to register an account, please fill in your personal information to continue registering an account. Once you have an account, you will easily track your orders. If you want to purchase without an account, please click on the order without an account section.",
    "content_4": "Step 4: Fill in your information to receive your order, choose payment and shipping method for your order.",
    "content_5": "Step 5: Review your order information, fill in notes and submit your order. Once we receive your order, we will contact you by phone to confirm your order and address. Thank you very much."
  },
  "InformationSecurity": {
    "title": "Personal Information Security",
    "content_1": "Thank you for your interest and visit to our website. We respect and are committed to protecting your privacy.",
    "content_2": "This privacy policy explains how we receive, use, and (in certain cases) disclose your personal information.",
    "content_3": "Protecting personal data and building trust with our customers is very important to us. Therefore, we will use your name and other information related to you in accordance with the content of this Privacy Policy. We only collect necessary information related to the purchase transaction.",
    "content_4": "We will keep your information for the period required by law or for any purpose. You can access the website and browse without providing personal details. At that time, you are anonymous, and we cannot know who you are if you do not log into your account.",
    "content_5": "1. Collecting personal information",
    "content_6": "- We collect, store, and process your information for the purchase process and for later notifications related to the order, and to provide services, including some personal information: title, name, gender, date of birth, email, address, delivery address, phone number, fax, payment details, card payment details, or bank account details.",
    "content_7": "- We will use the information you provided to process your order, provide services and information through the website, and at your request.",
    "content_8": "- Furthermore, we will use that information to manage your account; verify and carry out online transactions, identify visitors on the web, conduct demographic research, send information including product and service information. If you do not want to receive any marketing information from us, you can refuse at any time.",
    "content_9": "- We may transfer your name and address to a third party to deliver the goods to you (for example, to a courier or supplier).",
    "content_10": "- Your order details are kept by us, but for security reasons, we cannot disclose them directly. However, you can access the information by logging into your account on the web. Here, you will see your order details, received products, sent products, and email, bank, and newsletter details that you have subscribed to long-term.",
    "content_11": "- You are committed to keeping your personal data confidential and not disclosing it to any third party. We are not responsible for any misuse of the password if it is not our fault.",
    "content_12": "- We may use your personal information for market research. All details will be hidden and only used for statistics. You can refuse to participate at any time.",
    "content_13": "2. Security",
    "content_14": "- We have appropriate technical and security measures to prevent unauthorized or unlawful access or loss or destruction or damage to your information.",
    "content_15": "- We advise you not to disclose payment details to anyone via email, and we are not responsible for any losses you may incur in exchanging your information over the internet or email.",
    "content_16": "- You absolutely must not use any program, tool, or other form to interfere with the system or change the data structure. It is strictly forbidden to distribute, propagate, or encourage any activity to interfere, destroy, or infiltrate the data of the website system. Any violations will result in the forfeiture of all rights and will be prosecuted before the law if necessary.",
    "content_17": "- All transaction information will be kept confidential, but in case of legal requirements, we will be forced to provide this information to the legal authorities. The terms, conditions, and content of this website are governed by Vietnamese law, and the Vietnamese courts have jurisdiction to review.",
    "content_18": "3. Customer rights",
    "content_19": "- You have the right to request access to your personal data, the right to ask us to correct any errors in your data at no cost. At any time, you also have the right to ask us to stop using your personal data for marketing purposes."
  },
  "MembershipPolicy": {
    "title": "Membership Policy",
    "content_1": "Membership Policy Conditions",
    "content_2": "1. Membership Card Conditions for issuing a membership card: When customers make purchases at the Tonatra restaurant system, they will be issued a membership card.",
    "content_3": "2. VIP Card",
    "content_4": "Conditions for receiving a VIP card:",
    "content_5": "+ Total order value greater than 15 million VND/month",
    "content_6": "+ Purchase with a value of 3 million VND or more",
    "content_7": "+ Participate in Tonatra's activities and promotions",
    "content_8": "Note: The limits of 10, 20, 30, 50, 100 million VND are calculated from the time of the first purchase until the card is upgraded. When upgrading to a VIP card and accumulating further to 20 to 100 million VND, this total amount is calculated from the first purchase and accumulated."
  },
  "NotFound": {
    "title": "404",
    "content_1": "Something went wrong!",
    "content_2": "Sorry, we couldn't find the page. You will find many things to explore on",
    "content_3": "Home Page",
    "content_4": "Back to Home Page"
  },
  "PaymentInstruction": {
    "title": "Payment Instructions",
    "content_1": "Choose payment account information",
    "content_2": "If you already have an account, please enter your username, which is your email, and password in the existing account section on the system.",
    "content_3": "If you do not have an account and want to register, please fill in your personal information to continue registering. Having an account will make it easier for you to track your orders.",
    "content_4": "If you want to make a purchase without an account, please click on the order without an account section.",
    "content_5": "+ Fill in your information to receive the order, choose the payment and shipping method for your order.",
    "content_6": "+ Review the order information, add notes, and submit the order. After receiving your order, we will contact you by phone to confirm the order and your address. Thank you."
  },
  "Introduce": {
    "title": "About Us",
    "content": "TONATRA RESTAURANT - A modern culinary restaurant combined with tradition, creating novelty for diners. Established in 2024 with the motto 'customers first', we are always proud of our service and the dishes we create. Our restaurant always puts customers first, dedicated to serving, bringing customers the best experiences. The dishes with exclusive recipes will bring new flavors to diners. Tonatra Restaurant sincerely thanks you.",
    "title_gallery": "Photo Gallery",
    "content_footer": "COME TO TONATRA RESTAURANT TO ENJOY NOW!"
  },
  "Carousel": {
    "des": "Diverse dishes",
    "button": "Booking now!"
  },
  "Booking": {
    "required_fullName": "Full name is required",
    "required_email": "Email is required",
    "invalid_email": "Invalid email",
    "required_phoneNumber": "Phone number is required",
    "invalid_phoneNumber": "Invalid phone number",
    "required_arrivalDate": "Arrival date is required",
    "required_arrivalTime": "Arrival time is required",
    "required_numberOfPeople": "Number of people is required",
    "invalidMinNumber": "Number of people must be at least 1",
    "invalidMaxNumber": "Number of people must be at most 10",
    "title": "Contact for Booking",
    "label_fullName": "Full Name",
    "input_fullName": "Enter full name...",
    "label_email": "Email",
    "input_email": "Enter email...",
    "label_phoneNumber": "Phone Number",
    "input_phoneNumber": "Enter phone number...",
    "label_number": "Number of People",
    "input_number": "Enter number of people...",
    "label_arrivalDate": "Arrival Date",
    "label_arrivalTime": "Arrival Time",
    "content_1": "Or contact directly via: ",
    "button": "Book Now"
  },
  "Home": {
    "OpeningHours": {
      "title": "Opening Hours",
      "des": "Tonatra Restaurant always welcomes you to dine with the following operating hours:",
      "content_1": "Monday to Friday:",
      "content_2": "7:00 AM - 10:00 PM",
      "content_3": "Saturday to Sunday:",
      "content_4": "6:00 AM - 11:30 PM",
      "content_5": "Online ordering on the Website is available 24/7",
      "content_6": "Call now! ",
      "content_7": "Store",
      "content_8": "Staff",
      "content_9": "Customers",
      "content_10": "Dishes"
    },
    "About": {
      "title": "About Us",
      "des": "Our restaurant always puts customers first, dedicated to serving, bringing customers the best experiences. The dishes with exclusive recipes will bring new flavors to diners. Tonatra Restaurant sincerely thanks you.",
      "viewMore": "View More"
    },
    "Quality": {
      "title-1": "Master Chefs",
      "title-2": "Quality Food",
      "title-3": "Online Ordering",
      "title-4": "24/7 Service",
      "content-1": "Our chefs are experienced and highly skilled.",
      "content-2": "We always ensure the best food quality for our customers.",
      "content-3": "We provide online ordering service for customer convenience.",
      "content-4": "We offer 24/7 service for customers anytime, anywhere."
    },
    "CategoryOutstanding": {
      "title": "Outstanding Categories",
      "content-1": "Chicken Dishes",
      "content-2": "Pork Dishes",
      "content-3": "Beef Dishes",
      "content-4": "Fish Dishes",
      "content-5": "Other Dishes",
      "des1": "Chicken dishes are delicately prepared with the most special flavors",
      "des2": "Pork dishes are delicately prepared with the most special flavors",
      "des3": "Beef dishes are delicately prepared with the most special flavors",
      "des4": "Fish dishes are delicately prepared with the most special flavors",
      "des5": "Dishes are delicately prepared with the most special flavors"
    },
    "Menu": {
      "title": "Our Menu",
      "des": "Our restaurant menu delicately combines traditional and modern cuisine, offering a diverse and unique experience. From light appetizers, rich main courses to sweet desserts, all are made from fresh, carefully selected ingredients.",
      "button1": "Main Courses",
      "button2": "Appetizers",
      "button3": "Noodles - Rice - Porridge",
      "button4": "Soups - Broths",
      "button5": "Desserts",
      "button6": "Drinks",
      "des1": "Experience attractive main courses with a variety of rich options from different ingredients, meticulously prepared by talented chefs",
      "des2": "Start your meal with delicate appetizers such as creamy pumpkin soup or fresh spring rolls, offering unique and pleasant flavors",
      "des3": "Restaurant noodles with chewy noodles - Soft white rice - Smoothly cooked porridge, blended with various ingredients",
      "des4": "Refreshing broths with clear broth - Smooth, creamy soups",
      "des5": "End your meal with sweet desserts like flan, chewy taro pudding, or coconut ice cream, bringing satisfaction to your taste buds",
      "des6": "Enjoy refreshing drinks such as fruit smoothies, herbal teas, or creative cocktails, suitable for all preferences."
    },
    "News": {
      "title": "News",
      "author": "Posted by: ",
      "viewmore": "View more"
    }
  },
  "ResetPassword": {
    "verify_email": "Verify email",
    "verification_code": "Verification code",
    "new_password": "New password",
    "next": "Next",
    "back": "Back",
    "done": "Done",
    "required_email": "Email is required",
    "invalid_email": "Invalid email",
    "password_min": "Password must be at least 6 characters",
    "password_max": "Password must be at most 25 characters",
    "required_password": "Password is required",
    "required_verification_code": "Verification code is required"
  }
}
