{
  "PaymentPolicy": {
    "title_page": "Chính sách thanh toán",
    "content_1": "Khách hàng thanh toán trực tiếp tại cửa hàng",
    "content_2": "+ Nhận quà tặng kèm",
    "content_3": "+ Checkin tại cửa hàng Khách hàng thanh toán online",
    "content_4": "+ Chuyển khoản trước khi nhận hàng",
    "content_5": "+ Quà tặng kèm bất kỳ Khách hàng có nhu cầu khiếu nại, đổi trả sản phẩm do lỗi của Tonatra có thể liên hệ qua Hotline 0292 3831 530 để được hỗ trợ sớm nhất.",
    "content_6": "Tư vấn viên sẽ hướng dẫn khách hàng các bước cần thiết để tiến hành trả thanh toán."
  },
  "Header": {
    "Navbar": {
      "close": "Đóng",
      "home": "Trang chủ",
      "introduce": "Giới thiệu",
      "menu": "Thực đơn",
      "bestDish": "Món nổi bật",
      "deliciousDish": "Món ngon mỗi ngày",
      "news": "Tin tức",
      "contact": "Liên hệ",
      "booking": "Đặt bàn",
      "login": "Đăng nhập",
      "register": "Đăng ký",
      "logout": "Đăng xuất",
      "favoriteDish": "Món ăn yêu thích",
      "inputSearch": "Nhập tên món ăn...",
      "myAccount": "Trang cá nhân",
      "myPurchase": "Đơn hàng",
      "myReservation": "Đơn đặt bàn"
    },
    "Search": {
      "search": "TÌM KIẾM MÓN ĂN CỦA BẠN",
      "resultSearch": "KẾT QUẢ TÌM KIẾM",
      "seeAll": "Xem tất cả",
      "noData": "Không tìm thấy bất kỳ kết quả nào"
    }
  },
  "Footer": {
    "introduce": "Nhà hàng chúng tôi luôn luôn đặt khách hàng lên hàng đầu, tận tâm phục vụ, mang lại cho khách hàng những trãi nghiệm tuyệt vời nhất. Các món ăn với công thức độc quyền sẽ mang lại hương vị mới mẻ cho thực khách. Tonatra xin chân thành cảm ơn.",
    "branch": "Chi nhánh",
    "address": "Địa chỉ",
    "phone": "Điện thoại",
    "email": "Email",
    "title_instruct": "Hướng dẫn",
    "instruct_1": "Hướng dẫn mua hàng",
    "instruct_2": "Hướng dẫn thanh toán",
    "instruct_3": "Đăng ký thành viên",
    "instruct_4": "Hỗ trợ khách hàng",
    "title_policy": "Chính sách",
    "policy_1": "Chính sách thành viên",
    "policy_2": "Chính sách thanh toán",
    "policy_3": "Hướng dẫn mua hàng",
    "policy_4": "Bảo mật thông tin",
    "social": "Mạng xã hội",
    "method_payment": "Hình thức thanh toán",
    "copy_right": "Bản quyền | © 2024 Tonatra CTU Nhóm 4 CT250"
  },
  "BreadcrumbsAndTitle": {
    "home": "Trang chủ",
    "contact": "Liên hệ",
    "news": "Tin tức",
    "introduction": "Giới thiệu",
    "delicious_dishes": "Món ngon mỗi ngày",
    "best_dishes": "Món ăn nổi bật",
    "login": "Đăng nhập",
    "register": "Đăng ký",
    "cart": "Giỏ hàng",
    "booking": "Đặt bàn",
    "all_dishes": "Tất cả món ăn",
    "my_account": {
      "account": "Trang cá nhân",
      "edit_profile": "Sửa hồ sơ",
      "change_password": "Đổi mật khẩu",
      "delete_account": "Xóa tài khoản"
    },
    "search": "Tìm kiếm",
    "payment_instruction": "Hướng dẫn thanh toán",
    "buying_guide": "Hướng dẫn mua hàng",
    "membership_policy": "Chính sách thành viên",
    "payment_policy": "Chính sách thanh toán",
    "information_security": "Bảo mật thông tin",
    "favorite_dishes": "Món ăn yêu thích",
    "not_found": "404 Không tìm thấy trang",
    "payment": "Thanh toán",
    "reset_password": "Lấy lại mật khẩu",
    "reservation_orders": "Đơn đặt bàn",
    "purchase": "Đơn hàng",
    "orderDetail": "Chi tiết đơn hàng"
  },
  "Auth": {
    "login": "Đăng nhập",
    "register": "Đăng ký",
    "username": "Tên người dùng",
    "email": "Email",
    "password": "Mật khẩu",
    "confirm_password": "Mật khẩu xác nhận",
    "forgot_password": "Quên mật khẩu?",
    "login_with": "Hoặc đăng nhập bằng",
    "required_email": "Email thì bắt buộc",
    "invalid_email": "Email không hợp lệ",
    "password_min": "Mật khẩu phải có tối thiểu là 6 kí tự",
    "password_max": "Mật khẩu phải có tối đa là 25 kí tự",
    "required_password": "Mật khẩu thì bắt buộc",
    "required_username": "Tên người dùng thì bắt buộc",
    "required_confirm_password": "Mật khẩu xác nhận thì bắt buộc",
    "confirm_password_not_match": "Mật khẩu xác nhận không khớp"
  },
  "Contact": {
    "title": "Liên hệ với chúng tôi",
    "fullName": "Họ và tên",
    "email": "Email",
    "phoneNumber": "Số điện thoại",
    "content": "Nội dung",
    "button": "Gửi thông tin",
    "invalid_fullName": "Vui lòng nhập họ tên",
    "invalid_email": "Email không hợp lệ",
    "required_email": "Vui lòng nhập email",
    "invalid_phoneNumber": "Số điện thoại không hợp lệ!",
    "required_phoneNumber": "Vui lòng nhập số điện thoại",
    "required_content": "Vui lòng nhập nội dung",
    "introduce": {
      "title": "nhà hàng tonatra restaurant",
      "des": "Tonatra Restaurant - nơi những trải nghiệm ẩm thực thăng hoa. Nhà hàng chúng tôi luôn luôn đặt khách hàng lên hàng đầu, tận tâm phục vụ, mang lại cho khách hàng những trãi nghiệm tuyệt với nhất. Các món ăn với công thức độc quyền sẽ mang lại hương vị mới mẻ cho thực khách. Đừng bỏ lỡ cơ hội thưởng thức những món ăn ngon với giá cả phải chăng tại Tonatra. Chúng tôi rất hân hạnh được phục vụ quý khách. Tonatra Restaurant xin chân thành cảm ơn.",
      "branch": "Cửa hàng chính",
      "address": "Địa chỉ: ",
      "phoneNumber": "Điện thoại: ",
      "email": "Email: "
    }
  },
  "BuyingGuide": {
    "title": "Hướng dẫn mua hàng",
    "content_1": "Bước 1: Truy cập website và lựa chọn món ăn cần mua",
    "content_2": "Bước 2: Click và sản phẩm muốn mua, màn hình hiển thị ra pop up với các lựa chọn sau. Nếu bạn muốn tiếp tục mua hàng: Bấm vào phần tiếp tục mua hàng để lựa chọn thêm sản phẩm vào giỏ hàng. Nếu bạn muốn xem giỏ hàng để cập nhật sản phẩm: Bấm vào xem giỏ hàng Nếu bạn muốn đặt hàng và thanh toán cho sản phẩm này vui lòng bấm vào: Đặt hàng và thanh toán",
    "content_3": "Bước 3: Lựa chọn thông tin tài khoản thanh toán. Nếu bạn đã có tài khoản vui lòng nhập thông tin tên đăng nhập là email và mật khẩu vào mục đã có tài khoản trên hệ thống. Nếu bạn chưa có tài khoản và muốn đăng ký tài khoản vui lòng điền các thông tin cá nhân để tiếp tục đăng ký tài khoản. Khi có tài khoản bạn sẽ dễ dàng theo dõi được đơn hàng của mình Nếu bạn muốn mua hàng mà không cần tài khoản vui lòng nhấp chuột vào mục đặt hàng không cần tài khoản",
    "content_4": "Bước 4: Điền các thông tin của bạn để nhận đơn hàng, lựa chọn hình thức thanh toán và vận chuyển cho đơn hàng của mình",
    "content_5": "Bước 5: Xem lại thông tin đặt hàng, điền chú thích và gửi đơn hàng Sau khi nhận được đơn hàng bạn gửi chúng tôi sẽ liên hệ bằng cách gọi điện lại để xác nhận lại đơn hàng và địa chỉ của bạn. Trân trọng cảm ơn."
  },
  "InformationSecurity": {
    "title": "Bảo mật thông tin cá nhân",
    "content_1": "Cám ơn quý khách đã quan tâm và truy cập vào website. Chúng tôi tôn trọng và cam kết sẽ bảo mật những thông tin mang tính riêng tư của Quý khách.",
    "content_2": "Chính sách bảo mật sẽ giải thích cách chúng tôi tiếp nhận, sử dụng và (trong trường hợp nào đó) tiết lộ thông tin cá nhân của Quý khách.",
    "content_3": "Bảo vệ dữ liệu cá nhân và gây dựng được niềm tin cho quý khách là vấn đề rất quan trọng với chúng tôi. Vì vậy, chúng tôi sẽ dùng tên và các thông tin khác liên quan đến quý khách tuân thủ theo nội dung của Chính sách bảo mật. Chúng tôi chỉ thu thập những thông tin cần thiết liên quan đến giao dịch mua bán.",
    "content_4": "Chúng tôi sẽ giữ thông tin của khách hàng trong thời gian luật pháp quy định hoặc cho mục đích nào đó. Quý khách có thể truy cập vào website và trình duyệt mà không cần phải cung cấp chi tiết cá nhân. Lúc đó, Quý khách đang ẩn danh và chúng tôi không thể biết bạn là ai nếu Quý khách không đăng nhập vào tài khoản của mình.",
    "content_5": "1. Thu thập thông tin cá nhân",
    "content_6": "- Chúng tôi thu thập, lưu trữ và xử lý thông tin của bạn cho quá trình mua hàng và cho những thông báo sau này liên quan đến đơn hàng, và để cung cấp dịch vụ, bao gồm một số thông tin cá nhân: danh hiệu, tên, giới tính, ngày sinh, email, địa chỉ, địa chỉ giao hàng, số điện thoại, fax, chi tiết thanh toán, chi tiết thanh toán bằng thẻ hoặc chi tiết tài khoản ngân hàng.",
    "content_7": "- Chúng tôi sẽ dùng thông tin quý khách đã cung cấp để xử lý đơn đặt hàng, cung cấp các dịch vụ và thông tin yêu cầu thông qua website và theo yêu cầu của bạn.",
    "content_8": "- Hơn nữa, chúng tôi sẽ sử dụng các thông tin đó để quản lý tài khoản của bạn; xác minh và thực hiện giao dịch trực tuyến, nhận diện khách vào web, nghiên cứu nhân khẩu học, gửi thông tin bao gồm thông tin sản phẩm và dịch vụ. Nếu quý khách không muốn nhận bất cứ thông tin tiếp thị của chúng tôi thì có thể từ chối bất cứ lúc nào.",
    "content_9": "- Chúng tôi có thể chuyển tên và địa chỉ cho bên thứ ba để họ giao hàng cho bạn (ví dụ cho bên chuyển phát nhanh hoặc nhà cung cấp).",
    "content_10": "- Chi tiết đơn đặt hàng của bạn được chúng tôi lưu giữ nhưng vì lí do bảo mật nên chúng tôi không công khai trực tiếp được. Tuy nhiên, quý khách có thể tiếp cận thông tin bằng cách đăng nhập tài khoản trên web. Tại đây, quý khách sẽ thấy chi tiết đơn đặt hàng của mình, những sản phẩm đã nhận và những sản phẩm đã gửi và chi tiết email, ngân hàng và bản tin mà bạn đặt theo dõi dài hạn.",
    "content_11": "- Quý khách cam kết bảo mật dữ liệu cá nhân và không được phép tiết lộ cho bên thứ ba. Chúng tôi không chịu bất kỳ trách nhiệm nào cho việc dùng sai mật khẩu nếu đây không phải lỗi của chúng tôi.",
    "content_12": "- Chúng tôi có thể dùng thông tin cá nhân của bạn để nghiên cứu thị trường. mọi thông tin chi tiết sẽ được ẩn và chỉ được dùng để thống kê. Quý khách có thể từ chối không tham gia bất cứ lúc nào.",
    "content_13": "2. Bảo mật",
    "content_14": "- Chúng tôi có biện pháp thích hợp về kỹ thuật và an ninh để ngăn chặn truy cập trái phép hoặc trái pháp luật hoặc mất mát hoặc tiêu hủy hoặc thiệt hại cho thông tin của bạn.",
    "content_15": "- Chúng tôi khuyên quý khách không nên đưa thông tin chi tiết về việc thanh toán với bất kỳ ai bằng e-mail, chúng tôi không chịu trách nhiệm về những mất mát quý khách có thể gánh chịu trong việc trao đổi thông tin của quý khách qua internet hoặc email.",
    "content_16": "- Quý khách tuyệt đối không sử dụng bất kỳ chương trình, công cụ hay hình thức nào khác để can thiệp vào hệ thống hay làm thay đổi cấu trúc dữ liệu. Nghiêm cấm việc phát tán, truyền bá hay cổ vũ cho bất kỳ hoạt động nào nhằm can thiệp, phá hoại hay xâm nhập vào dữ liệu của hệ thống website. Mọi vi phạm sẽ bị tước bỏ mọi quyền lợi cũng như sẽ bị truy tố trước pháp luật nếu cần thiết.",
    "content_17": "- Mọi thông tin giao dịch sẽ được bảo mật nhưng trong trường hợp cơ quan pháp luật yêu cầu, chúng tôi sẽ buộc phải cung cấp những thông tin này cho các cơ quan pháp luật. Các điều kiện, điều khoản và nội dung của trang web này được điều chỉnh bởi luật pháp Việt Nam và tòa án Việt Nam có thẩm quyền xem xét.",
    "content_18": "3. Quyền lợi khách hàng",
    "content_19": "- Quý khách có quyền yêu cầu truy cập vào dữ liệu cá nhân của mình, có quyền yêu cầu chúng tôi sửa lại những sai sót trong dữ liệu của bạn mà không mất phí. Bất cứ lúc nào bạn cũng có quyền yêu cầu chúng tôi ngưng sử dụng dữ liệu cá nhân của bạn cho mục đích tiếp thị."
  },
  "MembershipPolicy": {
    "title": "Chính sách thành viên",
    "content_1": "Điều kiện chính sách thành viên",
    "content_2": "1. Thẻ thành viên Điều kiện cấp thẻ thành viên: Khi khách hàng mua hàng trên hệ thống nhà hàng Tonatra sẽ được cấp thẻ thành viên.",
    "content_3": "2. Thẻ VIP",
    "content_4": "Điều kiện nhận thẻ VIP:",
    "content_5": "+ Có giá trị tổng đơn hàng lớn hơn 15 triệu/ tháng",
    "content_6": "+ Mua hàng với giá trị 3 triệu trợ lên",
    "content_7": "+ Tham gia các hoạt động, chương trình khuyến mãi của Tonatra",
    "content_8": "Lưu ý: Hạn mức 10, 20, 30, 50,100 triệu đồng là tính từ thời điểm bắt đầu mua tới khi lên thẻ. Khi lên thẻ VIP và tích tiếp lên 20 đến 100 triệu, tổng tiền này là tính từ khi khách hàng mua lần đầu và cộng dồn lên."
  },
  "NotFound": {
    "title": "404",
    "content_1": "Có điều gì đó không ổn!.",
    "content_2": "Xin lỗi, chúng tôi không thể tìm thấy trang. Bạn sẽ tìm thấy rất nhiều điều để khám phá trên",
    "content_3": "Trang Chủ",
    "content_4": "Trở về trang chủ"
  },
  "PaymentInstruction": {
    "title": "Hướng dẫn thanh toán",
    "content_1": "Lựa chọn thông tin tài khoản thanh toán",
    "content_2": "Nếu bạn đã có tài khoản vui lòng nhập thông tin tên đăng nhập là email và mật khẩu vào mục đã có tài khoản trên hệ thống",
    "content_3": "Nếu bạn chưa có tài khoản và muốn đăng ký tài khoản vui lòng điền các thông tin cá nhân để tiếp tục đăng ký tài khoản. Khi có tài khoản bạn sẽ dễ dàng theo dõi được đơn hàng của mình",
    "content_4": "Nếu bạn muốn mua hàng mà không cần tài khoản vui lòng nhấp chuột vào mục đặt hàng không cần tài khoản",
    "content_5": "+ Điền các thông tin của bạn để nhận đơn hàng, lựa chọn hình thức thanh toán và vận chuyển cho đơn hàng của mình",
    "content_6": "+ Xem lại thông tin đặt hàng, điền chú thích và gửi đơn hàng Sau khi nhận được đơn hàng bạn gửi chúng tôi sẽ liên hệ bằng cách gọi điện lại để xác nhận lại đơn hàng và địa chỉ của bạn. Trân trọng cảm ơn."
  },
  "Introduce": {
    "title": "Giới thiệu",
    "content": " TONATRA RESTAURANT - Nhà hàng ẩm thực hiện đại kết hợp với truyền thống, tạo nên tính mới lạ cho thực khách. Được ra đời vào năm 2024 với tiêu chí khách hàng là trên hết nên chúng tôi luôn tự hào về cách phục vụ cũng như các món ăn mà chúng tôi làm ra. Nhà hàng chúng tôi luôn luôn đặt khách hàng lên hàng đầu, tận tâm phục vụ, mang lại cho khách hàng những trãi nghiệm tuyệt với nhất. Các món ăn với công thức độc quyền sẽ mang lại hương vị mới mẻ cho thực khách. Tonatra Restaurant xin chân thành cảm ơn.",
    "title_gallery": "Thư viện ảnh",
    "content_footer": "HÃY ĐẾN TONATRA RESTAURANT ĐỂ THƯỞNG THỨC NGAY BẠN NHÉ!"
  },
  "Carousel": {
    "des": "Món ăn đa dạng",
    "button": "Đặt bàn ngay!"
  },
  "Booking": {
    "required_fullName": "Họ và tên không được để trống",
    "required_email": "Email không được để trống",
    "invalid_email": "Email không hợp lệ",
    "required_phoneNumber": "Số điện thoại không được để trống",
    "invalid_phoneNumber": "Số điện thoại không hợp lệ",
    "required_arrivalDate": "Ngày đến nhận bàn không được để trống",
    "required_arrivalTime": "Thời gian đến nhận bàn không được để trống",
    "required_numberOfPeople": "Số lượng người không được để trống",
    "invalidMinNumber": "Số lượng người phải lớn hơn tối thiểu là 1",
    "invalidMaxNumber": "Số lượng người phải nhỏ hơn tối đa là 30",
    "title": "Liên hệ đặt bàn",
    "label_fullName": "Họ và tên",
    "input_fullName": "Nhập họ và tên...",
    "label_email": "Email",
    "input_email": "Nhập email...",
    "label_phoneNumber": "Số điện thoại",
    "input_phoneNumber": "Nhập số điện thoại...",
    "label_number": "Số lượng người",
    "input_number": "Nhập số lượng người...",
    "label_arrivalDate": "Ngày đến nhận bàn",
    "label_arrivalTime": "Thời gian đến nhận bàn",
    "label_note": "Ghi chú (tùy chọn)",
    "content_1": "Hoặc liên hệ trực tiếp qua: ",
    "button": "Đặt bàn ngay",
    "notifications": {
      "title": "Bạn đã đặt bàn thành công",
      "notification_1": "Yêu cầu đặt bàn của bàn đã được ghi nhận và đang chờ xử lý. Mọi sự thay đổi liên quan đến đơn đặt bàn này sẽ được thông báo thông qua email mà bạn đã cung cấp khi đặt bàn.",
      "notification_2": "Cảm ơn bạn đã tin tưởng và sử dụng dịch vụ của Nhà hàng Tonatra!"
    }
  },
  "Home": {
    "OpeningHours": {
      "title": "Giờ mở cửa",
      "des": "Nhà hàng Tonatra luôn chào mừng quý khách đến ăn với các khung giờ hoạt động:",
      "content_1": "Thứ 2 đến Thứ 6:",
      "content_2": "7:00 sáng - 10:00 tối",
      "content_3": "Thứ 7 đến Chủ Nhật:",
      "content_4": "6:00 sáng - 11:30 tối",
      "content_5": "Riêng việc đặt hàng trên Website luôn hoạt động 24/7",
      "content_6": "Gọi ngay! ",
      "content_7": "Cửa hàng",
      "content_8": "Nhân viên",
      "content_9": "Khách hàng",
      "content_10": "Món ăn"
    },
    "About": {
      "title": "Về chúng tôi",
      "des": "  Nhà hàng chúng tôi luôn luôn đặt khách hàng lên hàng đầu, tận tâm phục vụ, mang lại cho khách hàng những trãi nghiệm tuyệt với nhất. Các món ăn với công thức độc quyền sẽ mang lại hương vị mới mẻ cho thực khách. Tonatra Restaurant xin chân thành cảm ơn.",
      "viewMore": "Xem thêm"
    },
    "Quality": {
      "title-1": "Đầu bếp bậc thầy",
      "title-2": "Đồ ăn chất lượng",
      "title-3": "Đặt hàng online",
      "title-4": "Dịch vụ 24/7",
      "content-1": "Đầu bếp của chúng tôi đều là những người có kinh nghiệm và tay nghề cao.",
      "content-2": "Chúng tôi luôn đảm bảo chất lượng thực phẩm tốt nhất cho khách hàng.",
      "content-3": "Chúng tôi cung cấp dịch vụ đặt hàng online cho khách hàng tiện lợi.",
      "content-4": "Chúng tôi cung cấp dịch vụ 24/7 cho khách hàng mọi lúc mọi nơi."
    },
    "CategoryOutstanding": {
      "title": "Danh mục nổi bật",
      "content-1": "Món gà",
      "content-2": "Món heo",
      "content-3": "Món bò",
      "content-4": "Món cá",
      "content-5": "Các món khác",
      "des1": "Các món gà được chế biến tinh tế với hương vị đặc biệt nhất",
      "des2": "Các món heo được chế biến tinh tế với hương vị đặc biệt nhất",
      "des3": "Các món bò được chế biến tinh tế với hương vị đặc biệt nhất",
      "des4": "Các món cá được chế biến tinh tế với hương vị đặc biệt nhất",
      "des5": "Các món được chế biến tinh tế với hương vị đặc biệt nhất"
    },
    "Menu": {
      "title": "Thực đơn của chúng tôi",
      "des": "Thực đơn nhà hàng chúng tôi kết hợp tinh tế giữa ẩm thực truyền thống và hiện đại, mang đến trải nghiệm đa dạng và độc đáo. Từ khai vị nhẹ nhàng, món chính phong phú đến tráng miệng ngọt ngào, tất cả đều được chế biến từ nguyên liệu tươi ngon, chọn lọc kỹ lưỡng."
    },
    "News": {
      "title": "Tin tức",
      "author": "Đăng bởi: ",
      "viewmore": "Xem thêm"
    },
    "DishOutstanding": {
      "title": "Món ăn nổi bật",
      "viewmore": "Xem thêm"
    },
    "Comment": {
      "title": "Đánh giá khách hàng"
    }
  },
  "ResetPassword": {
    "verify_email": "Xác minh email",
    "verification_code": "Mã xác minh",
    "new_password": "Mật khẩu mới",
    "next": "Tiếp tục",
    "back": "Trở về",
    "done": "Hoàn thành",
    "required_email": "Email thì bắt buộc",
    "invalid_email": "Email không hợp lệ",
    "password_min": "Mật khẩu phải có tối thiểu là 6 kí tự",
    "password_max": "Mật khẩu phải có tối đa là 25 kí tự",
    "required_password": "Mật khẩu thì bắt buộc",
    "required_verification_code": "Mã xác minh thì bắt buộc"
  },
  "DishMenuSidebar": {
    "filter": "Lọc",
    "close": "Đóng",
    "dishCategories": "Danh mục món ăn",
    "choosePrice": "Chọn mức giá",
    "youChoose": "Bạn chọn",
    "clearAll": "Bỏ tất cả",
    "costs": {
      "<100000": "Dưới 100.000đ",
      "100000-200000": "Từ 100.000đ - 200.000đ",
      "200000-500000": "Từ 200.000đ - 500.000đ",
      "500000-1tr": "Từ 500.000đ - 1 triệu",
      ">1tr": "Trên 1 triệu"
    },
    "sort": {
      "default": "Mặc định",
      "a-z": "Tên A - Z",
      "z-a": "Tên Z - A",
      "ascPrice": "Giá tăng dần",
      "descPrice": "Giá giảm dần",
      "newestDish": "Món ăn mới nhất",
      "oldestDish": "Món ăn cũ nhất"
    }
  },
  "DishPage": {
    "title": "Tất cả món ăn",
    "noData": "Không có dữ liệu."
  },
  "BestDishPage": {
    "title": "Món ăn nổi bật"
  },
  "DeliciousDishPage": {
    "title": "Món ngon mỗi ngày"
  },
  "CartPage": {
    "title": "Giỏ hàng của bạn",
    "dish": "Món ăn",
    "price": "Đơn giá",
    "quantity": "Số lượng",
    "totalPrice": "Thành tiền",
    "deleteAll": "Xóa tất cả",
    "totalPayment": "Tổng thanh toán",
    "totalDish": "{{total}} món ăn",
    "order": "Thanh toán",
    "emptyCart": "Không có món ăn nào trong giỏ hàng của bạn.",
    "addToCart": "Thêm món ngay"
  },
  "ManageAccount": {
    "profile": "Hồ sơ",
    "editProfile": "Sửa hồ sơ",
    "changePassword": "Đổi mật khẩu",
    "deleteAccount": "Xóa tài khoản",
    "myPurchase": "Đơn hàng",
    "myReservation": "Đơn đặt bàn",
    "password_min": "Mật khẩu phải có tối thiểu là 6 kí tự",
    "password_max": "Mật khẩu phải có tối đa là 25 kí tự",
    "required_password": "Mật khẩu thì bắt buộc",
    "required_confirm_password": "Mật khẩu xác nhận thì bắt buộc",
    "confirm_password_not_match": "Mật khẩu xác nhận không khớp",
    "different_current_password": "Mật khẩu mới phải khác với mật khẩu hiện tại",
    "profilePage": {
      "title_1": "Hồ sơ của tôi",
      "title_2": "Quản lý và bảo mật tài khoản của bạn",
      "personalInfor": "Thông tin cá nhân",
      "contactInfor": "Thông tin liên lạc",
      "username": "Tên người dùng",
      "fullName": "Họ tên",
      "birthday": "Sinh nhật",
      "gender": "Giới tính",
      "phone": "Điện thoại",
      "address": "Địa chỉ"
    },
    "changePasswordPage": {
      "title": "Đổi mật khẩu",
      "currentPassword": "Mật khẩu hiện tại",
      "newPassword": "Mật khẩu mới",
      "confirmPassword": "Xác nhận mật khẩu",
      "updatePassword": "Cập nhật mật khẩu",
      "forgotPassword": "Tôi đã quên mật khẩu"
    },
    "deleteAccountPage": {
      "title": "Xóa tài khoản",
      "confirmation": {
        "confirm_0": "Bạn đang yêu cầu xóa tài khoản của mình. Vui lòng lưu ý rằng:",
        "confirm_1": "Tất cả thông tin cá nhân, đơn hàng, và lịch sử giao dịch của bạn sẽ bị xóa vĩnh viễn.",
        "confirm_2": "Sau khi tài khoản bị xóa, bạn sẽ không thể khôi phục lại bất kỳ dữ liệu nào.",
        "confirm_3": "Nếu bạn có bất kỳ đơn hàng nào đang chờ xử lý, chúng sẽ bị hủy và không thể hoàn tất.",
        "confirm_4": "Việc xóa tài khoản không thể hoàn tác.",
        "isAgreed": "Có, tôi muốn xóa vĩnh viễn tài khoản này và tất cả các dữ liệu của tài khoản.",
        "delete": "Xóa bỏ"
      },
      "verify_identity": "Xác minh danh tính",
      "password": "Mật khẩu",
      "continue": "Tiếp tục",
      "cancel": "Hủy",
      "finishConfirm": "Việc xóa tài khoản sẽ không thể khôi phục lại. Bạn có chắc chắn muốn xóa tài khoản của mình không?",
      "qualified": {
        "warning_0": "Cảnh báo:",
        "warning_1": "Tài khoản của bạn hiện đang có:",
        "warning_2": "Vui lòng hoàn thành hết tất cả các đơn này trước khi thực hiện xóa tài khoản.",
        "purchase": "đơn hàng đang được vận chuyển.",
        "reservation": "đơn đặt bàn đã được xử lý và xác nhận.",
        "thanks": "Tonatra cảm ơn!"
      }
    },
    "editProfilePage": {
      "title": "Sửa hồ sơ",
      "username": "Tên người dùng",
      "fullName": "Họ tên",
      "birthday": "Sinh nhật",
      "gender": "Giới tính",
      "phone": "Điện thoại",
      "address": "Địa chỉ",
      "required_username": "Tên người dùng thì bắt buộc",
      "male": "Nam",
      "female": "Nữ",
      "other": "Khác",
      "upload": "Tải lên",
      "noAvt": "Gỡ ảnh",
      "format": "Định dạng: Chấp nhận tất cả định dạng của hình ảnh",
      "save": "Lưu"
    }
  },
  "Modal": {
    "defaultContent": "Bạn có chăc chắn hay không?",
    "ok": "Có, tôi chắc chắn",
    "cancel": "Không, hủy"
  },
  "DishDetailPage": {
    "introduce": "Tonatra giới thiệu",
    "seeAll": "Xem tất cả",
    "sold": "đã bán",
    "quantity": "Số lượng",
    "addToCart": "Thêm vào giỏ hàng",
    "buyNow": "Mua ngay",
    "detailInformation": "Thông tin chi tiết",
    "category": "Danh mục",
    "ingredients": "Thành phần",
    "servingSize": "Khẩu phần",
    "completionTime": "Thời gian hoàn tất",
    "dishDescription": "Mô tả món ăn",
    "dishReview": "Đánh giá sản phẩm",
    "review": "đánh giá",
    "star": "sao",
    "similarDish": "Món ăn cùng loại",
    "notFound": "Không tìm thấy món ăn."
  },
  "NewsPage": {
    "title": "Tin tức"
  },
  "PurchasesPage": {
    "all": "Tất cả",
    "toConfirm": "Chờ xác nhận",
    "toShip": "Đang vận chuyển",
    "completed": "Hoàn thành",
    "cancelled": "Đã hủy",
    "orderId": "Mã đơn",
    "seeMore": "Xem thêm sản phẩm",
    "dish": "món ăn",
    "buyAgain": "Mua lại",
    "viewRating": "Xem đánh giá",
    "orderTotal": "Thành tiền",
    "emptyData": "Chưa có đơn hàng"
  },
  "OrderDetailsPage": {
    "back": "Trở về",
    "orderId": "Mã đơn",
    "thanks": "Cảm ơn bạn đã mua sắm với Tonatra!",
    "buyAgain": "Mua lại",
    "viewRating": "Xem đánh giá",
    "rating": "Đánh giá",
    "deliveryAddress": "Địa chỉ giao hàng",
    "notes": "Ghi chú",
    "paymentMethod": "Phương thức thanh toán",
    "merchandiseSubtotal": "Tổng tiền hàng",
    "shippingFee": "Phí vận chuyển",
    "voucherApplied": "Mã giảm giá từ nhà hàng",
    "orderTotal": "Thành tiền",
    "cancelOrder": "Hủy đặt hàng"
  },
  "ReviewModal": {
    "title": "Đánh giá đơn hàng"
  },
  "ReservationOrderPage": {
    "all": "Tất cả",
    "toConfirm": "Chờ xác nhận",
    "confirmed": "Đã xác nhận",
    "completed": "Hoàn thành",
    "cancelled": "Đã hủy",
    "orderId": "Mã đơn",
    "customer": "Người đặt",
    "peopleNumber": "Số người",
    "checkIn": "Nhận bàn vào",
    "table": "Bàn",
    "notes": "Ghi chú",
    "phone": "Điện thoại",
    "cancelReservation": "Hủy đặt bàn",
    "emptyData": "Chưa có đơn",
    "deleteConfirm": "Bạn có chắc chắn muốn hủy đơn đặt bàn với mã là {{id}} này không?"
  },
  "SearchPage": {
    "title": "Có {{total}} kết quả tìm kiếm phù hợp với từ khóa '{{keyword}}'",
    "notFound": "Không tìm thấy bất kỳ kết quả nào phù hợp với từ khóa '{{keyword}}'"
  }
}
